package com.softserve.Your_Farkop_bot.enums;

public enum MessageResponseEnum {
    WELCOME_MESSAGE("/start", """
            Вас вітає ТМ "Автопристрій"!
            Ми є найбільшим виробником фаркопів в Україні!
            НЕ зупинили виробництво під час війни та регулярно допомагаємо армії та волонтерам!                
            
            Хочеш обрати фаркоп для свого авто - натисни /begin
            Хочеш дізнатися більше про нас - натисни /information
            """),
    BEGIN_MESSAGE("/begin", """
         Для підбору фаркопу АВТОПРИСТРІЙ Обери марку та модель свого авто з переліченого:
          Хочеш дізнатися більше про нас - натисни /information
            """),


//    AUDI
    Q5("/Q5", """
            Ви обрали автомобіль Audi Q5!
            Вартість фаркопу для вашого авто становить 3570грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    A4_B8("/A4_B8", """
            Ви обрали автомобіль Audi A4_B8!
            Вартість фаркопу для вашого авто становить 3890грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    Q3("/Q3", """
            Ви обрали автомобіль Audi Q3!
            Вартість фаркопу для вашого авто становить 3950грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

//BMW
    X3("/X3", """
            Ви обрали автомобіль BMW_X5!
            Вартість фаркопу для вашого авто становить 3950грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    X5("/X5", """
            Ви обрали автомобіль BMW X5!
            Вартість фаркопу для вашого авто становить 3950грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    BMW_320D("/BMW_320D", """
            Ви обрали автомобіль BMW 320D!
            Вартість фаркопу для вашого авто становить 3852грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),


//    CHERRY
    Tiggo_4("/Tiggo_4", """
            Ви обрали автомобіль CHERRY Tiggo 4!
            Вартість фаркопу для вашого авто становить 3950грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    Tiggo_5("/Tiggo_5", """
            Ви обрали автомобіль CHERRY Tiggo 5!
            Вартість фаркопу для вашого авто становить 3950грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    Tiggo_7("/Tiggo_7", """
            Ви обрали автомобіль CHERRY Tiggo 7!
            Вартість фаркопу для вашого авто становить 3852грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    Tiggo_8("/Tiggo_8", """
            Ви обрали автомобіль CHERRY Tiggo 8!
            Вартість фаркопу для вашого авто становить 3852грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

//    CHEVROLET
    AVEO("/AVEO", """
            Ви обрали автомобіль CHEVROLET AVEO!
            Вартість фаркопу для вашого авто становить 3950грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    CAPTIVA("/CAPTIVA", """
            Ви обрали автомобіль CHEVROLET CAPTIVA!
            Вартість фаркопу для вашого авто становить 3950грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    LACETTI("/LACETTI", """
            Ви обрали автомобіль CHEVROLET LACETTI!
            Вартість фаркопу для вашого авто становить 3852грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    NUBIRA("/NUBIRA", """
            Ви обрали автомобіль CHEVROLET NUBIRA!
            Вартість фаркопу для вашого авто становить 3852грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),


    // FIAT
    DOBLO("/DOBLO", """
            Ви обрали автомобіль FIAT DOBLO!
            Вартість фаркопу для вашого авто становить 3715грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    DUCATO("/DUCATO", """
            Ви обрали автомобіль FIAT DUCATO!
            Вартість фаркопу для вашого авто становить 3790грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    SCUDO("/SCUDO", """
            Ви обрали автомобіль FIAT SCUDO!
            Вартість фаркопу для вашого авто становить 3250грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    // FORD
    FIESTA("/FIESTA", """
            Ви обрали автомобіль FORD FIESTA!
            Вартість фаркопу для вашого авто становить 3715грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    FOCUS("/FOCUS", """
            Ви обрали автомобіль FORD FOCUS!
            Вартість фаркопу для вашого авто становить 3890грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    FUSION("/FUSION", """
            Ви обрали автомобіль FORD FUSION!
            Вартість фаркопу для вашого авто становить 3260грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),

    MONDEO("/MONDEO", """
            Ви обрали автомобіль FORD FUSION!
            Вартість фаркопу для вашого авто становить 3450грн.
            Для замовлення  зателефонуйте за номером 099-3136226
            Для підбору фаркопу на інше авто - натисни /begin"""),




    MANAGER_MESSAGE("/MANAGER",
            """
                    Якщо не знайшли свого авто:
                    Для уточнення цін та термінів доставки,
                    радимо зв'язатися з менеджером за телефоном:
                    099-3136226
                    
                    Для підбору фаркопу на інше авто - натисни /begin
                                        
                    """),
    INFORMATOIN_MESSAGE("/information", """
            ТМ "Автопристрій" - фірма, що спеціалізується на виробництві Фаркопів, Причепів та Захистів двигунів.
            Ми офіційно працюємо вже понад 20 років.
            Регулярно проходимо сертифікаційні випробування наших виробів та завжди несемо повну відповідальність за свою продукцію.
            
            Наша локація: вул. П. Захарова, 36, м. Тульчин, Вінницька обл.
            Наші телефони:098-0795377; 093-5205162
            
            Хочеш обрати фаркоп для свого авто - натисни /begin
            """),



    DEFAULT_MESSAGE(null, "Вас вітає АВТОПРИСТРІЙ! Натисни, будь ласка, /start, щоб розпочати спілкування.");
    private final String key;
    private final String message;

    MessageResponseEnum(String key, String message) {
        this.key = key;
        this.message = message;
    }

    public String getKey() {
        return key;
    }

    public String getMessage() {
        return message;
    }

}
